---
kind: property
id: P:Autodesk.Revit.DB.View.TemporaryViewModes
zh: 视图
source: html/4828f9cb-4759-2fdb-e842-a592533f6b8c.htm
---
# Autodesk.Revit.DB.View.TemporaryViewModes Property

**中文**: 视图

Data of temporary view modes associated with this view.

## Syntax (C#)
```csharp
public TemporaryViewModes TemporaryViewModes { get; }
```

## Remarks
Temporary view modes are available in graphic views only.